# Spark SQL Examples

Run the code cells below. This is the same code from the previous screencast.

In [1]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import udf
from pyspark.sql.types import StringType
from pyspark.sql.types import IntegerType
from pyspark.sql.functions import desc
from pyspark.sql.functions import asc
from pyspark.sql.functions import sum as Fsum

import datetime

import numpy as np
import pandas as pd
%matplotlib inline
import matplotlib.pyplot as plt

Define a new Spark Session

In [4]:
spark = SparkSession \
    .builder \
    .appName("Data wrangling with Spark SQL") \
    .getOrCreate()

Load the same old Titanic data (in json instead of csv)

In [5]:
path = "titanic.json"
df = spark.read.json(path)

Check couple of rows

In [6]:
df.take(2)

[Row(Age=22.0, Cabin=None, Embarked='S', Fare=7.25, Name='Braund, Mr. Owen Harris', Parch=0, PassengerId=1, Pclass=3, Sex='male', SibSp=1, Survived=0, Ticket='A/5 21171'),
 Row(Age=38.0, Cabin='C85', Embarked='C', Fare=71.2833, Name='Cumings, Mrs. John Bradley (Florence Briggs Thayer)', Parch=0, PassengerId=2, Pclass=1, Sex='female', SibSp=1, Survived=1, Ticket='PC 17599')]

If you are not aware about the schema then check it through printschema

In [7]:
df.printSchema()

root
 |-- Age: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Name: string (nullable = true)
 |-- Parch: long (nullable = true)
 |-- PassengerId: long (nullable = true)
 |-- Pclass: long (nullable = true)
 |-- Sex: string (nullable = true)
 |-- SibSp: long (nullable = true)
 |-- Survived: long (nullable = true)
 |-- Ticket: string (nullable = true)

# Create a View And Run Queries

The code below creates a temporary view against which we can run SQL queries.

In [8]:
df.createOrReplaceTempView("titanic_table")

Check data through SQL query

In [10]:
spark.sql("SELECT * FROM titanic_table LIMIT 2").show()

+----+-----+--------+-------+--------------------+-----+-----------+------+------+-----+--------+---------+
| Age|Cabin|Embarked|   Fare|                Name|Parch|PassengerId|Pclass|   Sex|SibSp|Survived|   Ticket|
+----+-----+--------+-------+--------------------+-----+-----------+------+------+-----+--------+---------+
|22.0| null|       S|   7.25|Braund, Mr. Owen ...|    0|          1|     3|  male|    1|       0|A/5 21171|
|38.0|  C85|       C|71.2833|Cumings, Mrs. Joh...|    0|          2|     1|female|    1|       1| PC 17599|
+----+-----+--------+-------+--------------------+-----+-----------+------+------+-----+--------+---------+

we can use above format or below format to run SQL queries

In [11]:
spark.sql('''
          SELECT * 
          FROM titanic_table 
          LIMIT 2
          '''
           ).show()

+----+-----+--------+-------+--------------------+-----+-----------+------+------+-----+--------+---------+
| Age|Cabin|Embarked|   Fare|                Name|Parch|PassengerId|Pclass|   Sex|SibSp|Survived|   Ticket|
+----+-----+--------+-------+--------------------+-----+-----------+------+------+-----+--------+---------+
|22.0| null|       S|   7.25|Braund, Mr. Owen ...|    0|          1|     3|  male|    1|       0|A/5 21171|
|38.0|  C85|       C|71.2833|Cumings, Mrs. Joh...|    0|          2|     1|female|    1|       1| PC 17599|
+----+-----+--------+-------+--------------------+-----+-----------+------+------+-----+--------+---------+

Check total rows through SQL count function

In [12]:
spark.sql('''
          SELECT COUNT(*) 
          FROM titanic_table 
          '''
          ).show()

+--------+
|count(1)|
+--------+
|     891|
+--------+

Check other SQL functions

In [13]:
spark.sql('''
          SELECT Name, Age, Survived
          FROM titanic_table 
          WHERE Sex == 'male'
          '''
          ).collect()

[Row(Name='Braund, Mr. Owen Harris', Age=22.0, Survived=0),
 Row(Name='Allen, Mr. William Henry', Age=35.0, Survived=0),
 Row(Name='Moran, Mr. James', Age=None, Survived=0),
 Row(Name='McCarthy, Mr. Timothy J', Age=54.0, Survived=0),
 Row(Name='Palsson, Master. Gosta Leonard', Age=2.0, Survived=0),
 Row(Name='Saundercock, Mr. William Henry', Age=20.0, Survived=0),
 Row(Name='Andersson, Mr. Anders Johan', Age=39.0, Survived=0),
 Row(Name='Rice, Master. Eugene', Age=2.0, Survived=0),
 Row(Name='Williams, Mr. Charles Eugene', Age=None, Survived=1),
 Row(Name='Fynney, Mr. Joseph J', Age=35.0, Survived=0),
 Row(Name='Beesley, Mr. Lawrence', Age=34.0, Survived=1),
 Row(Name='Sloper, Mr. William Thompson', Age=28.0, Survived=1),
 Row(Name='Emir, Mr. Farred Chehab', Age=None, Survived=0),
 Row(Name='Fortune, Mr. Charles Alexander', Age=19.0, Survived=0),
 Row(Name='Todoroff, Mr. Lalio', Age=None, Survived=0),
 Row(Name='Uruchurtu, Don. Manuel E', Age=40.0, Survived=0),
 Row(Name='Wheadon, Mr. Edward H', Age=66.0, Survived=0),
 Row(Name='Meyer, Mr. Edgar Joseph', Age=28.0, Survived=0),
 Row(Name='Holverson, Mr. Alexander Oskar', Age=42.0, Survived=0),
 Row(Name='Mamee, Mr. Hanna', Age=None, Survived=1),
 Row(Name='Cann, Mr. Ernest Charles', Age=21.0, Survived=0),
 Row(Name='Kraeff, Mr. Theodor', Age=None, Survived=0),
 Row(Name='Rogers, Mr. William John', Age=None, Survived=0),
 Row(Name='Lennon, Mr. Denis', Age=None, Survived=0),
 Row(Name='Samaan, Mr. Youssef', Age=None, Survived=0),
 Row(Name='Panula, Master. Juha Niilo', Age=7.0, Survived=0),
 Row(Name='Nosworthy, Mr. Richard Cater', Age=21.0, Survived=0),
 Row(Name='Ostby, Mr. Engelhart Cornelius', Age=65.0, Survived=0),
 Row(Name='Woolner, Mr. Hugh', Age=None, Survived=1),
 Row(Name='Novel, Mr. Mansouer', Age=28.5, Survived=0),
 Row(Name='Goodwin, Master. William Frederick', Age=11.0, Survived=0),
 Row(Name='Sirayanian, Mr. Orsen', Age=22.0, Survived=0),
 Row(Name='Harris, Mr. Henry Birkhardt', Age=45.0, Survived=0),
 Row(Name='Skoog, Master. Harald', Age=4.0, Survived=0),
 Row(Name='Stewart, Mr. Albert A', Age=None, Survived=0),
 Row(Name='Moubarek, Master. Gerios', Age=None, Survived=1),
 Row(Name='Crease, Mr. Ernest James', Age=19.0, Survived=0),
 Row(Name='Kink, Mr. Vincenz', Age=26.0, Survived=0),
 Row(Name='Jenkin, Mr. Stephen Curnow', Age=32.0, Survived=0),
 Row(Name='Hood, Mr. Ambrose Jr', Age=21.0, Survived=0),
 Row(Name='Chronopoulos, Mr. Apostolos', Age=26.0, Survived=0),
 Row(Name='Bing, Mr. Lee', Age=32.0, Survived=1),
 Row(Name='Moen, Mr. Sigurd Hansen', Age=25.0, Survived=0),
 Row(Name='Staneff, Mr. Ivan', Age=None, Survived=0),
 Row(Name='Moutal, Mr. Rahamin Haim', Age=None, Survived=0),
 Row(Name='Caldwell, Master. Alden Gates', Age=0.83, Survived=1),
 Row(Name='Waelens, Mr. Achille', Age=22.0, Survived=0),
 Row(Name='Sheerlinck, Mr. Jan Baptist', Age=29.0, Survived=1),
 Row(Name='Carrau, Mr. Francisco M', Age=28.0, Survived=0),
 Row(Name='Ford, Mr. William Neal', Age=16.0, Survived=0),
 Row(Name='Slocovski, Mr. Selman Francis', Age=None, Survived=0),
 Row(Name='Celotti, Mr. Francesco', Age=24.0, Survived=0),
 Row(Name='Christmann, Mr. Emil', Age=29.0, Survived=0),
 Row(Name='Andreasson, Mr. Paul Edvin', Age=20.0, Survived=0),
 Row(Name='Chaffee, Mr. Herbert Fuller', Age=46.0, Survived=0),
 Row(Name='Dean, Mr. Bertram Frank', Age=26.0, Survived=0),
 Row(Name='Coxon, Mr. Daniel', Age=59.0, Survived=0),
 Row(Name='Shorney, Mr. Charles Joseph', Age=None, Survived=0),
 Row(Name='Goldschmidt, Mr. George B', Age=71.0, Survived=0),
 Row(Name='Greenfield, Mr. William Bertram', Age=23.0, Survived=1),
 Row(Name='Kantor, Mr. Sinai', Age=34.0, Survived=0),
 Row(Name='Petroff, Mr. Pastcho ("Pentcho")', Age=None, Survived=0),
 Row(Name='White, Mr. Richard Frasar', Age=21.0, Survived=0),
 Row(Name='Johansson, Mr. Gustaf Joel', Age=33.0, Survived=0),
 Row(Name='Gustafsson, Mr. Anders Vilhelm', Age=37.0, Survived=0),
 Row(Name='Mionoff, Mr. Stoytcho', Age=28.0, Survived=0),
 Row(Name='Moss, Mr. Albert Johan', Age=None, Survived=1),
 Row(Name='Rekic, Mr. Tido', Age=38.0, Survived=0),
 Row(Name='Porter, Mr. Walter Chamberlain', Age=47.0, Survived=0),
 Row(Name='Barton, Mr. David John', Age=22.0, Survived=0),
 Row(Name='Pekoniemi, Mr. Edvard', Age=21.0, Survived=0),
 Row(Name='Connors, Mr. Patrick', Age=70.5, Survived=0),
 Row(Name='Turpin, Mr. William John Robert', Age=29.0, Survived=0),
 Row(Name='Baxter, Mr. Quigg Edmond', Age=24.0, Survived=0),
 Row(Name='Hickman, Mr. Stanley George', Age=21.0, Survived=0),
 Row(Name='Moore, Mr. Leonard Charles', Age=None, Survived=0),
 Row(Name='Nasser, Mr. Nicholas', Age=32.5, Survived=0),
 Row(Name='White, Mr. Percival Wayland', Age=54.0, Survived=0),
 Row(Name='Nicola-Yarred, Master. Elias', Age=12.0, Survived=1),
 Row(Name='McMahon, Mr. Martin', Age=None, Survived=0),
 Row(Name='Madsen, Mr. Fridtjof Arne', Age=24.0, Survived=1),
 Row(Name='Ekstrom, Mr. Johan', Age=45.0, Survived=0),
 Row(Name='Drazenoic, Mr. Jozef', Age=33.0, Survived=0),
 Row(Name='Coelho, Mr. Domingos Fernandeo', Age=20.0, Survived=0),
 Row(Name='Sobey, Mr. Samuel James Hayden', Age=25.0, Survived=0),
 Row(Name='Richard, Mr. Emile', Age=23.0, Survived=0),
 Row(Name='Futrelle, Mr. Jacques Heath', Age=37.0, Survived=0),
 Row(Name='Osen, Mr. Olaf Elon', Age=16.0, Survived=0),
 Row(Name='Giglio, Mr. Victor', Age=24.0, Survived=0),
 Row(Name='Burke, Mr. Jeremiah', Age=19.0, Survived=0),
 Row(Name='Andrew, Mr. Edgardo Samuel', Age=18.0, Survived=0),
 Row(Name='Nicholls, Mr. Joseph Charles', Age=19.0, Survived=0),
 Row(Name='Andersson, Mr. August Edvard ("Wennerstrom")', Age=27.0, Survived=1),
 Row(Name='Navratil, Mr. Michel ("Louis M Hoffman")', Age=36.5, Survived=0),
 Row(Name='Byles, Rev. Thomas Roussel Davids', Age=42.0, Survived=0),
 Row(Name='Bateman, Rev. Robert James', Age=51.0, Survived=0),
 Row(Name='Meo, Mr. Alfonzo', Age=55.5, Survived=0),
 Row(Name='van Billiard, Mr. Austin Blyler', Age=40.5, Survived=0),
 Row(Name='Olsen, Mr. Ole Martin', Age=None, Survived=0),
 Row(Name='Williams, Mr. Charles Duane', Age=51.0, Survived=0),
 Row(Name='Corn, Mr. Harry', Age=30.0, Survived=0),
 Row(Name='Smiljanic, Mr. Mile', Age=None, Survived=0),
 Row(Name='Sage, Master. Thomas Henry', Age=None, Survived=0),
 Row(Name='Cribb, Mr. John Hatfield', Age=44.0, Survived=0),
 Row(Name='Bengtsson, Mr. John Viktor', Age=26.0, Survived=0),
 Row(Name='Calic, Mr. Jovo', Age=17.0, Survived=0),
 Row(Name='Panula, Master. Eino Viljami', Age=1.0, Survived=0),
 Row(Name='Goldsmith, Master. Frank John William "Frankie"', Age=9.0, Survived=1),
 Row(Name='Baumann, Mr. John D', Age=None, Survived=0),
 Row(Name='Ling, Mr. Lee', Age=28.0, Survived=0),
 Row(Name='Van der hoef, Mr. Wyckoff', Age=61.0, Survived=0),
 Row(Name='Rice, Master. Arthur', Age=4.0, Survived=0),
 Row(Name='Sivola, Mr. Antti Wilhelm', Age=21.0, Survived=0),
 Row(Name='Smith, Mr. James Clinch', Age=56.0, Survived=0),
 Row(Name='Klasen, Mr. Klas Albin', Age=18.0, Survived=0),
 Row(Name='Lefebre, Master. Henry Forbes', Age=None, Survived=0),
 Row(Name='Hale, Mr. Reginald', Age=30.0, Survived=0),
 Row(Name='Leonard, Mr. Lionel', Age=36.0, Survived=0),
 Row(Name='Pernot, Mr. Rene', Age=None, Survived=0),
 Row(Name='Asplund, Master. Clarence Gustaf Hugo', Age=9.0, Survived=0),
 Row(Name='Becker, Master. Richard F', Age=1.0, Survived=1),
 Row(Name='Rood, Mr. Hugh Roscoe', Age=None, Survived=0),
 Row(Name='Romaine, Mr. Charles Hallace ("Mr C Rolmane")', Age=45.0, Survived=1),
 Row(Name='Bourke, Mr. John', Age=40.0, Survived=0),
 Row(Name='Turcin, Mr. Stjepan', Age=36.0, Survived=0),
 Row(Name='Carbines, Mr. William', Age=19.0, Survived=0),
 Row(Name='Navratil, Master. Michel M', Age=3.0, Survived=1),
 Row(Name='Mernagh, Mr. Robert', Age=None, Survived=0),
 Row(Name='Olsen, Mr. Karl Siegwart Andreas', Age=42.0, Survived=0),
 Row(Name='Vande Walle, Mr. Nestor Cyriel', Age=28.0, Survived=0),
 Row(Name='Sage, Mr. Frederick', Age=None, Survived=0),
 Row(Name='Johanson, Mr. Jakob Alfred', Age=34.0, Survived=0),
 Row(Name='Youseff, Mr. Gerious', Age=45.5, Survived=0),
 Row(Name='Cohen, Mr. Gurshon "Gus"', Age=18.0, Survived=1),
 Row(Name='Backstrom, Mr. Karl Alfred', Age=32.0, Survived=0),
 Row(Name='Albimona, Mr. Nassef Cassem', Age=26.0, Survived=1),
 Row(Name='Blank, Mr. Henry', Age=40.0, Survived=1),
 Row(Name='Ali, Mr. Ahmed', Age=24.0, Survived=0),
 Row(Name='Perkin, Mr. John Henry', Age=22.0, Survived=0),
 Row(Name='Givard, Mr. Hans Kristensen', Age=30.0, Survived=0),
 Row(Name='Kiernan, Mr. Philip', Age=None, Survived=0),
 Row(Name='Jacobsohn, Mr. Sidney Samuel', Age=42.0, Survived=0),
 Row(Name='Harris, Mr. Walter', Age=30.0, Survived=0),
 Row(Name='Sunderland, Mr. Victor Francis', Age=16.0, Survived=1),
 Row(Name='Bracken, Mr. James H', Age=27.0, Survived=0),
 Row(Name='Green, Mr. George Henry', Age=51.0, Survived=0),
 Row(Name='Nenkoff, Mr. Christo', Age=None, Survived=0),
 Row(Name='Hoyt, Mr. Frederick Maxfield', Age=38.0, Survived=1),
 Row(Name='Berglund, Mr. Karl Ivar Sven', Age=22.0, Survived=0),
 Row(Name='Mellors, Mr. William John', Age=19.0, Survived=1),
 Row(Name='Lovell, Mr. John Hall ("Henry")', Age=20.5, Survived=0),
 Row(Name='Fahlstrom, Mr. Arne Jonas', Age=18.0, Survived=0),
 Row(Name='Larsson, Mr. Bengt Edvin', Age=29.0, Survived=0),
 Row(Name='Sjostedt, Mr. Ernst Adolf', Age=59.0, Survived=0),
 Row(Name='Leyson, Mr. Robert William Norman', Age=24.0, Survived=0),
 Row(Name='Hold, Mr. Stephen', Age=44.0, Survived=0),
 Row(Name='Pengelly, Mr. Frederick William', Age=19.0, Survived=0),
 Row(Name='Hunt, Mr. George Henry', Age=33.0, Survived=0),
 Row(Name='Coleridge, Mr. Reginald Charles', Age=29.0, Survived=0),
 Row(Name='Maenpaa, Mr. Matti Alexanteri', Age=22.0, Survived=0),
 Row(Name='Attalah, Mr. Sleiman', Age=30.0, Survived=0),
 Row(Name='Minahan, Dr. William Edward', Age=44.0, Survived=0),
 Row(Name='Beckwith, Mr. Richard Leonard', Age=37.0, Survived=1),
 Row(Name='Carter, Rev. Ernest Courtenay', Age=54.0, Survived=0),
 Row(Name='Reed, Mr. James George', Age=None, Survived=0),
 Row(Name='Stead, Mr. William Thomas', Age=62.0, Survived=0),
 Row(Name='Lobb, Mr. William Arthur', Age=30.0, Survived=0),
 Row(Name='Smith, Mr. Thomas', Age=None, Survived=0),
 Row(Name='Asplund, Master. Edvin Rojj Felix', Age=3.0, Survived=1),
 Row(Name='Taussig, Mr. Emil', Age=52.0, Survived=0),
 Row(Name='Harrison, Mr. William', Age=40.0, Survived=0),
 Row(Name='Reeves, Mr. David', Age=36.0, Survived=0),
 Row(Name='Panula, Mr. Ernesti Arvid', Age=16.0, Survived=0),
 Row(Name='Persson, Mr. Ernst Ulrik', Age=25.0, Survived=1),
 Row(Name='Cairns, Mr. Alexander', Age=None, Survived=0),
 Row(Name='Tornquist, Mr. William Henry', Age=25.0, Survived=1),
 Row(Name='Natsch, Mr. Charles H', Age=37.0, Survived=0),
 Row(Name='Parkes, Mr. Francis "Frank"', Age=None, Survived=0),
 Row(Name='Rice, Master. Eric', Age=7.0, Survived=0),
 Row(Name='Duane, Mr. Frank', Age=65.0, Survived=0),
 Row(Name='Olsson, Mr. Nils Johan Goransson', Age=28.0, Survived=0),
 Row(Name='de Pelsmaeker, Mr. Alfons', Age=16.0, Survived=0),
 Row(Name='Dorking, Mr. Edward Arthur', Age=19.0, Survived=1),
 Row(Name='Smith, Mr. Richard William', Age=None, Survived=0),
 Row(Name='Stankovic, Mr. Ivan', Age=33.0, Survived=0),
 Row(Name='de Mulder, Mr. Theodore', Age=30.0, Survived=1),
 Row(Name='Naidenoff, Mr. Penko', Age=22.0, Survived=0),
 Row(Name='Hosono, Mr. Masabumi', Age=42.0, Survived=1),
 Row(Name='Levy, Mr. Rene Jacques', Age=36.0, Survived=0),
 Row(Name='Mineff, Mr. Ivan', Age=24.0, Survived=0),
 Row(Name='Lewy, Mr. Ervin G', Age=None, Survived=0),
 Row(Name='Hanna, Mr. Mansour', Age=23.5, Survived=0),
 Row(Name='Saalfeld, Mr. Adolphe', Age=None, Survived=1),
 Row(Name='McCoy, Mr. Bernard', Age=None, Survived=1),
 Row(Name='Johnson, Mr. William Cahoone Jr', Age=19.0, Survived=0),
 Row(Name='Williams, Mr. Howard Hugh "Harry"', Age=None, Survived=0),
 Row(Name='Allison, Master. Hudson Trevor', Age=0.92, Survived=1),
 Row(Name='Abelson, Mr. Samuel', Age=30.0, Survived=0),
 Row(Name='Hendekovic, Mr. Ignjac', Age=28.0, Survived=0),
 Row(Name='Hart, Mr. Benjamin', Age=43.0, Survived=0),
 Row(Name='Moraweck, Dr. Ernest', Age=54.0, Survived=0),
 Row(Name='Dennis, Mr. Samuel', Age=22.0, Survived=0),
 Row(Name='Danoff, Mr. Yoto', Age=27.0, Survived=0),
 Row(Name='Sage, Mr. George John Jr', Age=None, Survived=0),
 Row(Name='Nysveen, Mr. Johan Hansen', Age=61.0, Survived=0),
 Row(Name='Partner, Mr. Austen', Age=45.5, Survived=0),
 Row(Name='Graham, Mr. George Edward', Age=38.0, Survived=0),
 Row(Name='Vander Planke, Mr. Leo Edmondus', Age=16.0, Survived=0),
 Row(Name='Denkoff, Mr. Mitto', Age=None, Survived=0),
 Row(Name='Pears, Mr. Thomas Clinton', Age=29.0, Survived=0),
 Row(Name='Dahl, Mr. Karl Edwart', Age=45.0, Survived=1),
 Row(Name='Blackwell, Mr. Stephen Weart', Age=45.0, Survived=0),
 Row(Name='Navratil, Master. Edmond Roger', Age=2.0, Survived=1),
 Row(Name='Collander, Mr. Erik Gustaf', Age=28.0, Survived=0),
 Row(Name='Sedgwick, Mr. Charles Frederick Waddington', Age=25.0, Survived=0),
 Row(Name='Fox, Mr. Stanley Hubert', Age=36.0, Survived=0),
 Row(Name='Coutts, Master. William Loch "William"', Age=3.0, Survived=1),
 Row(Name='Dimic, Mr. Jovan', Age=42.0, Survived=0),
 Row(Name='Odahl, Mr. Nils Martin', Age=23.0, Survived=0),
 Row(Name='Williams-Lambert, Mr. Fletcher Fellows', Age=None, Survived=0),
 Row(Name='Elias, Mr. Tannous', Age=15.0, Survived=0),
 Row(Name='Arnold-Franchi, Mr. Josef', Age=25.0, Survived=0),
 Row(Name='Yousif, Mr. Wazli', Age=None, Survived=0),
 Row(Name='Vanden Steen, Mr. Leo Peter', Age=28.0, Survived=0),
 Row(Name='Skoog, Mr. Wilhelm', Age=40.0, Survived=0),
 Row(Name='del Carlo, Mr. Sebastiano', Age=29.0, Survived=0),
 Row(Name='Asim, Mr. Adola', Age=35.0, Survived=0),
 Row(Name="O'Brien, Mr. Thomas", Age=None, Survived=0),
 Row(Name='Adahl, Mr. Mauritz Nils Martin', Age=30.0, Survived=0),
 Row(Name='Harder, Mr. George Achilles', Age=25.0, Survived=1),
 Row(Name='Wiklund, Mr. Jakob Alfred', Age=18.0, Survived=0),
 Row(Name='Beavan, Mr. William Thomas', Age=19.0, Survived=0),
 Row(Name='Ringhini, Mr. Sante', Age=22.0, Survived=0),
 Row(Name='Widener, Mr. Harry Elkins', Age=27.0, Survived=0),
 Row(Name='Betros, Mr. Tannous', Age=20.0, Survived=0),
 Row(Name='Gustafsson, Mr. Karl Gideon', Age=19.0, Survived=0),
 Row(Name='Tikkanen, Mr. Juho', Age=32.0, Survived=0),
 Row(Name='Plotcharsky, Mr. Vasil', Age=None, Survived=0),
 Row(Name='Davies, Mr. Charles Henry', Age=18.0, Survived=0),
 Row(Name='Goodwin, Master. Sidney Leonard', Age=1.0, Survived=0),
 Row(Name='Sadlier, Mr. Matthew', Age=None, Survived=0),
 Row(Name='Carter, Mr. William Ernest', Age=36.0, Survived=1),
 Row(Name='Jansson, Mr. Carl Olof', Age=21.0, Survived=1),
 Row(Name='Gustafsson, Mr. Johan Birger', Age=28.0, Survived=0),
 Row(Name='Johansson, Mr. Erik', Age=22.0, Survived=0),
 Row(Name='McKane, Mr. Peter David', Age=46.0, Survived=0),
 Row(Name='Pain, Dr. Alfred', Age=23.0, Survived=0),
 Row(Name='Niskanen, Mr. Juha', Age=39.0, Survived=1),
 Row(Name='Adams, Mr. John', Age=26.0, Survived=0),
 Row(Name='Hakkarainen, Mr. Pekka Pietari', Age=28.0, Survived=0),
 Row(Name='Gale, Mr. Shadrach', Age=34.0, Survived=0),
 Row(Name='Widegren, Mr. Carl/Charles Peter', Age=51.0, Survived=0),
 Row(Name='Richards, Master. William Rowe', Age=3.0, Survived=1),
 Row(Name='Birkeland, Mr. Hans Martin Monsen', Age=21.0, Survived=0),
 Row(Name='Sdycoff, Mr. Todor', Age=None, Survived=0),
 Row(Name='Hart, Mr. Henry', Age=None, Survived=0),
 Row(Name='Cunningham, Mr. Alfred Fleming', Age=None, Survived=0),
 Row(Name='Sundman, Mr. Johan Julian', Age=44.0, Survived=1),
 Row(Name='Matthews, Mr. William John', Age=30.0, Survived=0),
 Row(Name='Gheorgheff, Mr. Stanio', Age=None, Survived=0),
 Row(Name='Charters, Mr. David', Age=21.0, Survived=0),
 Row(Name='Zimmerman, Mr. Leo', Age=29.0, Survived=0),
 Row(Name='Rosblom, Mr. Viktor Richard', Age=18.0, Survived=0),
 Row(Name='Wiseman, Mr. Phillippe', Age=None, Survived=0),
 Row(Name='Flynn, Mr. James', Age=None, Survived=0),
 Row(Name='Pickard, Mr. Berk (Berk Trembisky)', Age=32.0, Survived=1),
 Row(Name='Bjornstrom-Steffansson, Mr. Mauritz Hakan', Age=28.0, Survived=1),
 Row(Name='Kallio, Mr. Nikolai Erland', Age=17.0, Survived=0),
 Row(Name='Silvey, Mr. William Baird', Age=50.0, Survived=0),
 Row(Name='Fortune, Mr. Mark', Age=64.0, Survived=0),
 Row(Name='Kvillner, Mr. Johan Henrik Johannesson', Age=31.0, Survived=0),
 Row(Name='Hampe, Mr. Leon', Age=20.0, Survived=0),
 Row(Name='Petterson, Mr. Johan Emil', Age=25.0, Survived=0),
 Row(Name='Johannesen-Bratthammer, Mr. Bernt', Age=None, Survived=1),
 Row(Name='Dodge, Master. Washington', Age=4.0, Survived=1),
 Row(Name='Seward, Mr. Frederic Kimber', Age=34.0, Survived=1),
 Row(Name='Peuchen, Major. Arthur Godfrey', Age=52.0, Survived=1),
 Row(Name='West, Mr. Edwy Arthur', Age=36.0, Survived=0),
 Row(Name='Hagland, Mr. Ingvald Olai Olsen', Age=None, Survived=0),
 Row(Name='Foreman, Mr. Benjamin Laventall', Age=30.0, Survived=0),
 Row(Name='Goldenberg, Mr. Samuel L', Age=49.0, Survived=1),
 Row(Name='Peduzzi, Mr. Joseph', Age=None, Survived=0),
 Row(Name='Jalsevac, Mr. Ivan', Age=29.0, Survived=1),
 Row(Name='Millet, Mr. Francis Davis', Age=65.0, Survived=0),
 Row(Name="O'Connor, Mr. Maurice", Age=None, Survived=0),
 Row(Name='Anderson, Mr. Harry', Age=48.0, Survived=1),
 Row(Name='Morley, Mr. William', Age=34.0, Survived=0),
 Row(Name='Gee, Mr. Arthur H', Age=47.0, Survived=0),
 Row(Name='Milling, Mr. Jacob Christian', Age=48.0, Survived=0),
 Row(Name='Maisner, Mr. Simon', Age=None, Survived=0),
 Row(Name='Goncalves, Mr. Manuel Estanslas', Age=38.0, Survived=0),
 Row(Name='Campbell, Mr. William', Age=None, Survived=0),
 Row(Name='Smart, Mr. John Montgomery', Age=56.0, Survived=0),
 Row(Name='Scanlan, Mr. James', Age=None, Survived=0),
 Row(Name='Keefe, Mr. Arthur', Age=None, Survived=0),
 Row(Name='Cacic, Mr. Luka', Age=38.0, Survived=0),
 Row(Name='Clifford, Mr. George Quincy', Age=None, Survived=0),
 Row(Name='Renouf, Mr. Peter Henry', Age=34.0, Survived=0),
 Row(Name='Braund, Mr. Lewis Richard', Age=29.0, Survived=0),
 Row(Name='Karlsson, Mr. Nils August', Age=22.0, Survived=0),
 Row(Name='Goodwin, Master. Harold Victor', Age=9.0, Survived=0),
 Row(Name='Frost, Mr. Anthony Wood "Archie"', Age=None, Survived=0),
 Row(Name='Rouse, Mr. Richard Henry', Age=50.0, Survived=0),
 Row(Name='Bishop, Mr. Dickinson H', Age=25.0, Survived=1),
 Row(Name='Kent, Mr. Edward Austin', Age=58.0, Survived=0),
 Row(Name='Somerton, Mr. Francis William', Age=30.0, Survived=0),
 Row(Name='Coutts, Master. Eden Leslie "Neville"', Age=9.0, Survived=1),
 Row(Name='Hagland, Mr. Konrad Mathias Reiersen', Age=None, Survived=0),
 Row(Name='Windelov, Mr. Einar', Age=21.0, Survived=0),
 Row(Name='Molson, Mr. Harry Markland', Age=55.0, Survived=0),
 Row(Name='Artagaveytia, Mr. Ramon', Age=71.0, Survived=0),
 Row(Name='Stanley, Mr. Edward Roland', Age=21.0, Survived=0),
 Row(Name='Yousseff, Mr. Gerious', Age=None, Survived=0),
 Row(Name='Shellard, Mr. Frederick William', Age=None, Survived=0),
 Row(Name='Svensson, Mr. Olof', Age=24.0, Survived=0),
 Row(Name='Calic, Mr. Petar', Age=17.0, Survived=0),
 Row(Name='Penasco y Castellana, Mr. Victor de Satode', Age=18.0, Survived=0),
 Row(Name='Bradley, Mr. George ("George Arthur Brayton")', Age=None, Survived=1),
 Row(Name='Olsen, Mr. Henry Margido', Age=28.0, Survived=0),
 Row(Name='Lang, Mr. Fang', Age=26.0, Survived=1),
 Row(Name='Daly, Mr. Eugene Patrick', Age=29.0, Survived=1),
 Row(Name='Webber, Mr. James', Age=None, Survived=0),
 Row(Name='McGough, Mr. James Robert', Age=36.0, Survived=1),
 Row(Name='Coleff, Mr. Satio', Age=24.0, Survived=0),
 Row(Name='Walker, Mr. William Anderson', Age=47.0, Survived=0),
 Row(Name='Ryan, Mr. Patrick', Age=None, Survived=0),
 Row(Name='Pavlovic, Mr. Stefo', Age=32.0, Survived=0),
 Row(Name='Vovk, Mr. Janko', Age=22.0, Survived=0),

In [14]:
spark.sql('''
          SELECT DISTINCT Cabin
          FROM titanic_table 
          ORDER BY Cabin ASC
          '''
          ).show()

+-----+
|Cabin|
+-----+
| null|
|  A10|
|  A14|
|  A16|
|  A19|
|  A20|
|  A23|
|  A24|
|  A26|
|  A31|
|  A32|
|  A34|
|  A36|
|   A5|
|   A6|
|   A7|
| B101|
| B102|
|  B18|
|  B19|
+-----+
only showing top 20 rows

# User Defined Functions

We first need to register the udf function before we can use it in SQL

In [15]:
spark.udf.register("name_prefix", lambda x: x.split(',')[1].strip(" ").split(" ")[0].strip(" "))

In [16]:
spark.sql('''
          SELECT *, name_prefix(Name) AS Name_Prfx
          FROM titanic_table 
          LIMIT 5
          '''
          ).collect()

[Row(Age=22.0, Cabin=None, Embarked='S', Fare=7.25, Name='Braund, Mr. Owen Harris', Parch=0, PassengerId=1, Pclass=3, Sex='male', SibSp=1, Survived=0, Ticket='A/5 21171', Name_Prfx='Mr.'),
 Row(Age=38.0, Cabin='C85', Embarked='C', Fare=71.2833, Name='Cumings, Mrs. John Bradley (Florence Briggs Thayer)', Parch=0, PassengerId=2, Pclass=1, Sex='female', SibSp=1, Survived=1, Ticket='PC 17599', Name_Prfx='Mrs.'),
 Row(Age=26.0, Cabin=None, Embarked='S', Fare=7.925, Name='Heikkinen, Miss. Laina', Parch=0, PassengerId=3, Pclass=3, Sex='female', SibSp=0, Survived=1, Ticket='STON/O2. 3101282', Name_Prfx='Miss.'),
 Row(Age=35.0, Cabin='C123', Embarked='S', Fare=53.1, Name='Futrelle, Mrs. Jacques Heath (Lily May Peel)', Parch=0, PassengerId=4, Pclass=1, Sex='female', SibSp=1, Survived=1, Ticket='113803', Name_Prfx='Mrs.'),
 Row(Age=35.0, Cabin=None, Embarked='S', Fare=8.05, Name='Allen, Mr. William Henry', Parch=0, PassengerId=5, Pclass=3, Sex='male', SibSp=0, Survived=0, Ticket='373450', Name_Prfx='Mr.')]

We can see Name_Prfx column in the above result

In [17]:
prefix_count = spark.sql('''
          SELECT name_prefix(Name) AS Name_Prfx, COUNT(*) as count_by_prefix
          FROM titanic_table
          WHERE Survived = 1
          GROUP BY Name_Prfx
          ORDER BY count_by_prefix DESC
          '''
          )

In [18]:
prefix_count.show()

+---------+---------------+
|Name_Prfx|count_by_prefix|
+---------+---------------+
|    Miss.|            127|
|     Mrs.|             99|
|      Mr.|             81|
|  Master.|             23|
|      Dr.|              3|
|    Mlle.|              2|
|      Ms.|              1|
|   Major.|              1|
|     Sir.|              1|
|     Col.|              1|
|     Mme.|              1|
|      the|              1|
|    Lady.|              1|
+---------+---------------+

# Converting Results to Pandas

We can easily covert the results to Pandas

In [20]:
prefix_count_pd = prefix_count.toPandas()

In [21]:
print(prefix_count_pd)

   Name_Prfx  count_by_prefix
0      Miss.              127
1       Mrs.               99
2        Mr.               81
3    Master.               23
4        Dr.                3
5      Mlle.                2
6        Ms.                1
7       Sir.                1
8     Major.                1
9       Col.                1
10      Mme.                1
11       the                1
12     Lady.                1